'''
http://pythontutor.ru/lessons/inout_and_arithmetic_operations/problems/aplusbplusc/
Напишите программу, которая считывает три числа и выводит их сумму.
Каждое число записано в отдельной строке.
'''

# Эта программа считывает два числа и выводит их сумму:
a = int(input())
b = int(input())
с = int(input())
print(a + b + с)

# Можете ли вы изменить её, чтобы она складывала три числа?
