'''
http://pythontutor.ru/lessons/inout_and_arithmetic_operations/problems/rect_triangle_square/
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
Каждое число записано в отдельной строке.
'''

# Числа b и h можно считывать так:
b = int(input())
h = int(input())

# Выводите результат через print()
print(0.5 * b * h)
