'''
http://pythontutor.ru/lessons/inout_and_arithmetic_operations/problems/hello_harry/
Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
'''

name = input()
print('Hello, ' + name + '!')
