'''
http://pythontutor.ru/lessons/ifelse/problems/minimum/
Даны два целых числа. Выведите значение наименьшего из них.
'''
val_01 = int(input())
val_02 = int(input())

if val_01 > val_02:
    print(val_02)
else:
    print(val_01)
